apache/nuttx/arch/arm/src/lpc54xx/lpc54_i2c_master.c
#ifdef CONFIG_LPC54_I2C1_MASTER
static struct lpc54_i2cdev_s g_i2c1_dev =
{
  .lock = NXMUTEX_INITIALIZER,
#  ifndef CONFIG_I2C_POLLED
  .waitsem = SEM_INITIALIZER(0),
#  endif
};
#endif

#ifdef CONFIG_LPC54_I2C2_MASTER
static struct lpc54_i2cdev_s g_i2c2_dev =
{
  .lock = NXMUTEX_INITIALIZER,
#  ifndef CONFIG_I2C_POLLED
  .waitsem = SEM_INITIALIZER(0),
#  endif
};
#endif

#ifdef CONFIG_LPC54_I2C3_MASTER
static struct lpc54_i2cdev_s g_i2c3_dev =
{
  .lock = NXMUTEX_INITIALIZER,
#  ifndef CONFIG_I2C_POLLED
  .waitsem = SEM_INITIALIZER(0),
#  endif
};
#endif

#ifdef CONFIG_LPC54_I2C4_MASTER
static struct lpc54_i2cdev_s g_i2c4_dev =
{
  .lock = NXMUTEX_INITIALIZER,
#  ifndef CONFIG_I2C_POLLED
  .waitsem = SEM_INITIALIZER(0),
#  endif
};
#endif

#ifdef CONFIG_LPC54_I2C5_MASTER
static struct lpc54_i2cdev_s g_i2c5_dev =
{
  .lock = NXMUTEX_INITIALIZER,
#  ifndef CONFIG_I2C_POLLED
  .waitsem = SEM_INITIALIZER(0),
#  endif
};
#endif

#ifdef CONFIG_LPC54_I2C6_MASTER
static struct lpc54_i2cdev_s g_i2c6_dev =
{
  .lock = NXMUTEX_INITIALIZER,
#  ifndef CONFIG_I2C_POLLED
  .waitsem = SEM_INITIALIZER(0),
#  endif
};
#endif

#ifdef CONFIG_LPC54_I2C7_MASTER
static struct lpc54_i2cdev_s g_i2c7_dev =
{
  .lock = NXMUTEX_INITIALIZER,
#  ifndef CONFIG_I2C_POLLED
  .waitsem = SEM_INITIALIZER(0),
#  endif
};
#endif

#ifdef CONFIG_LPC54_I2C8_MASTER
static struct lpc54_i2cdev_s g_i2c8_dev =
{
  .lock = NXMUTEX_INITIALIZER,
#  ifndef CONFIG_I2C_POLLED
  .waitsem = SEM_INITIALIZER(0),
#  endif
};
#endif

#ifdef CONFIG_LPC54_I2C9_MASTER
static struct lpc54_i2cdev_s g_i2c9_dev =
{
  .lock = NXMUTEX_INITIALIZER,
#  ifndef CONFIG_I2C_POLLED
  .waitsem = SEM_INITIALIZER(0),
#  endif
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: lpc54_i2c_putreg
 *
 * Description:
 *   Write a value to a register at the offset from the Flexcomm base.
 *
 ****************************************************************************/

static inline void lpc54_i2c_putreg(struct lpc54_i2cdev_s *priv,
                                    unsigned int regoffset, uint32_t regval)
{
  putreg32(regval, priv->base + regoffset);
}

/****************************************************************************
 * Name: lpc54_i2c_getreg
 *
 * Description:
 *   Read the content of a register at the offset from the Flexcomm base.
 *
 ****************************************************************************/

static inline uint32_t lpc54_i2c_getreg(struct lpc54_i2cdev_s *priv,
                                        unsigned int regoffset)
{
  return getreg32(priv->base + regoffset);
}

/****************************************************************************
 * Name: lpc54_i2c_setfrequency
 *
 * Description:
 *   Set the frequency for the next transfer
 *
 ****************************************************************************/

static void lpc54_i2c_setfrequency(struct lpc54_i2cdev_s *priv,
                                   uint32_t frequency)
{
  uint32_t scl;
  uint32_t divider;
  uint32_t best_scl;
  uint32_t best_div;
  uint32_t err;
  uint32_t best_err;
  uint32_t regval;

  i2cinfo("frequency %ld (%ld)\n", (long)frequency, (long)priv->frequency);

  /* Has the I2C frequency changed? */

  if (frequency != priv->frequency)
    {
      /* Yes.. instantiate the new I2C frequency */

      best_err = 0;

      for (scl = 9; scl >= 2; scl--)
        {
          /* Calculate ideal divider value for the current scl candidate.
           *
           *   SCL High Time:  Thi = divider * SCLhi
           *   SCL High Time:  Tlo = divider * SCLlo
           *                   Fscl = Finput / (Thi + Tlo)
           *
           * If Thi == TloL:   Fscl = Finput / (divider * SCL * 2)
           * Or:               divider = Finput / (Fscl * SCL * 2)
           */

          divider = priv->fclock / (frequency * scl * 2);

          /* Adjust it if it is out of range */

          if (divider > 0x00010000)
            {
              divider = 0x00010000;
            }

          /* Calculate the frequency error */

          err = priv->fclock - (frequency * scl * 2 * divider);
          if (err < best_err || best_err == 0)
            {
              best_div = divider;
              best_scl = scl;
              best_err = err;
            }

          if (err == 0 || divider >= 0x10000)
            {
              /* Break out of the loop early ifeither exact value was found
               * or the divider is at its maximum value.
               */

              break;
            }
        }

      /* Instantiate the new I2C frequency */

      regval = I2C_CLKDIV(best_div);
      lpc54_i2c_putreg(priv, LPC54_I2C_CLKDIV_OFFSET, regval);

      regval = I2C_MSTTIME_SCLLOW(best_scl) | I2C_MSTTIME_SCLHIGH(best_scl);
      lpc54_i2c_putreg(priv, LPC54_I2C_MSTTIME_OFFSET, regval);

      priv->frequency = frequency;
    }
}

/****************************************************************************
 * Name: lpc54_i2c_timeout
 *
 * Description:
 *   Watchdog timer for timeout of I2C operation
 *
 ****************************************************************************/

static void lpc54_i2c_timeout(wdparm_t arg)
{
  struct lpc54_i2cdev_s *priv = (struct lpc54_i2cdev_s *)arg;

#ifndef CONFIG_I2C_POLLED
  irqstate_t flags = enter_critical_section();
#endif

  i2cerr("ERROR: Timeout! state=%u\n", priv->state);

  /* Disable further I2C interrupts and return to the IDLE state with the
   * timeout result.
   */

  lpc54_i2c_putreg(priv, LPC54_I2C_INTENCLR_OFFSET, I2C_MASTER_INTS);
  priv->state  = I2CSTATE_IDLE;

  if (priv->result == OK)
    {
      priv->result = -ETIMEDOUT;
    }

#ifndef CONFIG_I2C_POLLED
  /* Wake up any waiters */

  nxsem_post(&priv->waitsem);
  leave_critical_section(flags);
#endif
}

/****************************************************************************
 * Name: lpc54_i2c_xfrsetup
 *
 * Description:
 *   Setup to initiate a transfer.
 *
 ****************************************************************************/

