apache/nuttx/arch/arm/src/lpc54xx/lpc54_i2c_master.c
static void lpc54_i2c_xfrsetup(struct lpc54_i2cdev_s *priv)
{
  struct i2c_msg_s *msg;

  DEBUGASSERT(priv != NULL && priv->msgs != NULL);
  msg = priv->msgs;

  /* Disable I2C interrupts while configuring for the transfer */

  lpc54_i2c_putreg(priv, LPC54_I2C_INTENCLR_OFFSET, I2C_MASTER_INTS);

  /* Set up for the transfer */

  priv->xfrd = 0;

  /* Select the initial state */

  if ((msg->flags & I2C_M_NOSTART) != 0)
    {
      /* Start condition will be omitted.  Begin the transfer in the data
       * phase.
       */

      if (msg->length == 0)
        {
          priv->state = I2CSTATE_STOP;
        }
      else if ((I2C_M_READ & msg->flags) == I2C_M_READ)
        {
          priv->state = I2CSTATE_RECEIVE;
        }
      else
        {
          priv->state = I2CSTATE_TRANSMIT;
        }
    }
  else
    {
      priv->state = I2CSTATE_START;
    }

  /* Set the I2C frequency if provided in this message.  Otherwise, use the
   * current I2C frequency setting.
   */

  if (msg->frequency > 0)
    {
      lpc54_i2c_setfrequency(priv, msg->frequency);
    }

  /* Clear error status bits */

  lpc54_i2c_putreg(priv, LPC54_I2C_STAT_OFFSET, I2C_INT_MSTARBLOSS |
                         I2C_INT_MSTSTSTPERR);

#ifndef CONFIG_I2C_POLLED
  /* Enable I2C master interrupts */

  lpc54_i2c_putreg(priv, LPC54_I2C_INTENSET_OFFSET, I2C_MASTER_INTS);
#endif
}

/****************************************************************************
 * Name: lpc54_i2c_nextmsg
 *
 * Description:
 *   Called at the completion of each message.  If there are more messages,
 *   this function will perform the setup for the next message.
 *
 ****************************************************************************/

static bool lpc54_i2c_nextmsg(struct lpc54_i2cdev_s *priv)
{
  irqstate_t flags;

  /* Disable interrupts to prevent the timeout while we make the decision
   * here.
   */

  flags = enter_critical_section();

  i2cinfo("nmsgs=%u\n", priv->nmsgs - 1);

  /* Decrement the number of messages remaining. */

  if (--priv->nmsgs > 0 && priv->result == OK)
    {
      /* There are more messages, set up for the next message */

      priv->msgs++;
      lpc54_i2c_xfrsetup(priv);

      i2cinfo("state=%u\n", priv->state);
      leave_critical_section(flags);
      return false;
    }
  else
    {
      /* That was the last message... we are done.
       * Cancel any timeout
       */

      wd_cancel(&priv->timeout);

      /* Disable further I2C interrupts  and return to the IDLE state */

      lpc54_i2c_putreg(priv, LPC54_I2C_INTENCLR_OFFSET, I2C_MASTER_INTS);
      priv->state = I2CSTATE_IDLE;

      i2cinfo("state=%u\n", priv->state);
      leave_critical_section(flags);
      return true;
    }
}

/****************************************************************************
 * Name: lpc54_i2c_statemachine
 *
 * Description:
 *   This is the I2C transfer state machine that implements the actual
 *   transfer.  It may be called from the interrupt level or is may be used
 *   without interrupts in a polled mode.
 *
 ****************************************************************************/

static bool lpc54_i2c_statemachine(struct lpc54_i2cdev_s *priv)
{
  struct i2c_msg_s *msg;
  uint32_t status;
  uint32_t mstate;

  DEBUGASSERT(priv != NULL && priv->msgs != NULL);
  msg = priv->msgs;

  i2cinfo("state=%u\n", priv->state);

  status = lpc54_i2c_getreg(priv, LPC54_I2C_STAT_OFFSET);

  if (status & I2C_INT_MSTARBLOSS)
    {
      i2cerr("ERROR: Arbitation loss\n");

      lpc54_i2c_putreg(priv, LPC54_I2C_STAT_OFFSET, I2C_INT_MSTARBLOSS);
      priv->result = -EIO;
      return true;
    }

  if (status & I2C_INT_MSTSTSTPERR)
    {
      i2cerr("ERROR: Start/stop error\n");

      lpc54_i2c_putreg(priv, LPC54_I2C_STAT_OFFSET, I2C_INT_MSTSTSTPERR);
      priv->result = -EIO;
      return true;
    }

  if ((status & I2C_INT_MSTPENDING) == 0)
    {
      i2cerr("ERROR: Busy\n");

      priv->result = -EBUSY;
      return true;
    }

  /* Get the state of the I2C module */

  mstate = (status & I2C_STAT_MSTSTATE_MASK) >> I2C_STAT_MSTSTATE_SHIFT;
  i2cinfo("mstate=%" PRIu32 "\n", mstate);

  if ((mstate == I2C_MASTER_STATE_ADDRNAK) ||
      (mstate == I2C_MASTER_STATE_DATANAK))
    {
      /* Slave NACKed last byte, issue stop and return error */

      lpc54_i2c_putreg(priv, LPC54_I2C_MSTCTL_OFFSET, I2C_MSTCTL_MSTSTOP);
      priv->result = -EPERM;
      priv->state  = I2CSTATE_WAITSTOP;

      i2cerr("ERROR:  NAKed, state=%u\n", priv->state);
      return false;
    }

  switch (priv->state)
    {
      case I2CSTATE_START:
        {
          enum lpc54_i2cstate_e newstate;

          if ((msg->flags & I2C_M_READ) == I2C_M_READ)
            {
              lpc54_i2c_putreg(priv, LPC54_I2C_MSTDAT_OFFSET,
                               I2C_READADDR8(msg->addr));
              newstate = I2CSTATE_RECEIVE;
            }
          else
            {
              lpc54_i2c_putreg(priv, LPC54_I2C_MSTDAT_OFFSET,
                               I2C_WRITEADDR8(msg->addr));
              newstate = I2CSTATE_TRANSMIT;
            }

          if (priv->xfrd >= msg->length)
            {
              /* No more data, setup for STOP */

              newstate = I2CSTATE_STOP;
            }

          priv->state = newstate;

          /* Send START condition */

          lpc54_i2c_putreg(priv, LPC54_I2C_MSTCTL_OFFSET,
                           I2C_MSTCTL_MSTSTART);
        }
        break;

      case I2CSTATE_TRANSMIT:
        {
          if (mstate != I2C_MASTER_STATE_TXOK)
            {
              i2cerr("ERROR bad state=%" PRIu32 ", expected %u\n",
                     mstate, I2C_MASTER_STATE_TXOK);

              priv->result = -EINVAL;
              return true;
            }

          lpc54_i2c_putreg(priv, LPC54_I2C_MSTDAT_OFFSET,
                           msg->buffer[priv->xfrd]);
          lpc54_i2c_putreg(priv, LPC54_I2C_MSTCTL_OFFSET,
                           I2C_MSTCTL_MSTCONTINUE);
          priv->xfrd++;

