apache/nuttx/arch/arm/src/lpc54xx/lpc54_i2c_master.c
          if (priv->xfrd >= msg->length)
            {
              /* No more data, schedule stop condition */

              priv->state = I2CSTATE_STOP;
            }
        }
        break;

      case I2CSTATE_RECEIVE:
        {
          if (mstate != I2C_MASTER_STATE_RXAVAIL)
            {
              i2cerr("ERROR bad state=%" PRIu32 ", expected %u\n",
                     mstate, I2C_MASTER_STATE_RXAVAIL);

              priv->result = -EINVAL;
              return true;
            }

          msg->buffer[priv->xfrd] =
            lpc54_i2c_getreg(priv, LPC54_I2C_MSTDAT_OFFSET);

          priv->xfrd++;
          if (priv->xfrd < msg->length)
            {
              lpc54_i2c_putreg(priv, LPC54_I2C_MSTCTL_OFFSET,
                               I2C_MSTCTL_MSTCONTINUE);
            }
          else
            {
              /* No more data expected, issue NACK and STOP right away */

              lpc54_i2c_putreg(priv, LPC54_I2C_MSTCTL_OFFSET,
                               I2C_MSTCTL_MSTSTOP);
              priv->state = I2CSTATE_WAITSTOP;
            }
        }
        break;

      case I2CSTATE_STOP:
        {
          bool dostop = true;

          /* Is this the last message? */

          if (priv->nmsgs > 1)
            {
              struct i2c_msg_s *nextmsg;

              /* No.. Is there a start on the next message?  If so, it
               * should be preceded by a STOP.
               */

              nextmsg = msg + 1;
              dostop  = ((nextmsg->flags & I2C_M_NOSTART) != 0);
            }

          if (dostop)
            {
              /* Stop condition is omitted, we are done. Start the next
               * message (or return to the IDLE state if none).
               */

              return lpc54_i2c_nextmsg(priv);
            }
          else
            {
              /* Send stop condition */

              lpc54_i2c_putreg(priv, LPC54_I2C_MSTCTL_OFFSET,
                               I2C_MSTCTL_MSTSTOP);
              priv->state = I2CSTATE_WAITSTOP;
            }
        }
        break;

      case I2CSTATE_WAITSTOP:
        {
          /* Start the next message (or return to the IDLE state if none). */

          return lpc54_i2c_nextmsg(priv);
        }
        break;

      case I2CSTATE_IDLE:
      default:
        priv->result = -EINVAL;
        return true;
    }

  i2cinfo("state=%u\n", priv->state);
  return false;
}

/****************************************************************************
 * Name: lpc54_i2c_interrupt
 *
 * Description:
 *   The I2C Interrupt Handler
 *
 ****************************************************************************/

#ifndef CONFIG_I2C_POLLED
static int lpc54_i2c_interrupt(int irq, void *context, void *arg)
{
  struct lpc54_i2cdev_s *priv = (struct lpc54_i2cdev_s *)arg;
  bool done;

  DEBUGASSERT(priv != NULL);

  /* Run the I2C state machine */

  done = lpc54_i2c_statemachine(priv);
  if (done)
    {
      /* Disable further I2C interrupts. */

      lpc54_i2c_putreg(priv, LPC54_I2C_INTENCLR_OFFSET, I2C_MASTER_INTS);

      /* Wake up wake up any waiters */

      nxsem_post(&priv->waitsem);
    }

  return OK;
}
#endif /* CONFIG_I2C_POLLED */

/****************************************************************************
 * Name: lpc54_i2c_transfer
 *
 * Description:
 *   Perform a sequence of I2C transfers
 *
 ****************************************************************************/

static int lpc54_i2c_transfer(struct i2c_master_s *dev,
                              struct i2c_msg_s *msgs, int count)
{
  struct lpc54_i2cdev_s *priv = (struct lpc54_i2cdev_s *)dev;
  int ret;

  i2cinfo("count=%d\n", count);
  DEBUGASSERT(dev != NULL && msgs != NULL);

  /* Get exclusive access to the I2C bus */

  nxmutex_lock(&priv->lock);

  /* Set up for the transfer */

  priv->xfrd   = 0;
  priv->msgs   = msgs;
  priv->nmsgs  = count;
  priv->result = OK;

  /* Set up the transfer timeout */

  wd_start(&priv->timeout, priv->nmsgs * I2C_WDOG_TIMEOUT,
           lpc54_i2c_timeout, (wdparm_t)priv);

  /* Initiate the transfer */

  lpc54_i2c_xfrsetup(priv);

  /* Loop until the transfer is complete or until a timeout occurs */

  do
    {
#ifndef CONFIG_I2C_POLLED
       nxsem_wait(&priv->waitsem);
#else
       lpc54_i2c_statemachine(priv);
#endif
    }
  while (priv->state != I2CSTATE_IDLE);

  ret = priv->result;
  i2cinfo("Done, result=%d\n", ret);

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: lpc54_i2c_reset
 *
 * Description:
 *   Perform an I2C bus reset in an attempt to break loose stuck I2C devices.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_RESET
static int lpc54_i2c_reset(struct i2c_master_s *dev)
{
#warning Missing logic
  return OK;
}
#endif /* CONFIG_I2C_RESET */

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: lpc54_i2cbus_initialize
 *
 * Description:
 *   Initialise an I2C device
 *
 ****************************************************************************/

struct i2c_master_s *lpc54_i2cbus_initialize(int port)
{
  struct lpc54_i2cdev_s *priv;
  irqstate_t flags;
  uint32_t regval;

  i2cinfo("port=%d\n", port);

  flags = enter_critical_section();

  /* Configure the requesting I2C peripheral */

  /* NOTE:  The basic FLEXCOMM initialization was performed in
   * lpc54_lowputc.c.
   */

#ifdef CONFIG_LPC54_I2C0_MASTER
  if (port == 0)
    {
      /* Attach 12 MHz clock to FLEXCOMM0 */

      lpc54_flexcomm0_enableclk();

      /* Set FLEXCOMM0 to the I2C peripheral, locking that configuration
       * in place.
       */

