apache/nuttx/arch/arm/src/lpc54xx/lpc54_i2c_master.c
      putreg32(FLEXCOMM_PSELID_PERSEL_I2C | FLEXCOMM_PSELID_LOCK,
               LPC54_FLEXCOMM7_PSELID);

      /* Initialize the state structure */

      priv           = &g_i2c7_dev;
      priv->base     = LPC54_FLEXCOMM7_BASE;
      priv->fclock   = BOARD_FLEXCOMM7_FCLK;
#ifndef CONFIG_I2C_POLLED
      priv->irq      = LPC54_IRQ_FLEXCOMM7;
#endif

      /* Configure I2C pins (defined in board.h) */

      lpc54_gpio_config(GPIO_I2C7_SCL);
      lpc54_gpio_config(GPIO_I2C7_SDA);

      /* Set up the FLEXCOMM7 function clock */

      putreg32(BOARD_FLEXCOMM7_CLKSEL, LPC54_SYSCON_FCLKSEL7);
    }
  else
#endif
#ifdef CONFIG_LPC54_I2C8_MASTER
  if (port == 8)
    {
      /* Attach 12 MHz clock to FLEXCOMM8 */

      lpc54_flexcomm8_enableclk();

      /* Set FLEXCOMM8 to the I2C peripheral, locking that configuration
       * in place.
       */

      putreg32(FLEXCOMM_PSELID_PERSEL_I2C | FLEXCOMM_PSELID_LOCK,
               LPC54_FLEXCOMM8_PSELID);

      /* Initialize the state structure */

      priv           = &g_i2c8_dev;
      priv->base     = LPC54_FLEXCOMM8_BASE;
      priv->fclock   = BOARD_FLEXCOMM8_FCLK;
#ifndef CONFIG_I2C_POLLED
      priv->irq      = LPC54_IRQ_FLEXCOMM8;
#endif

      /* Configure I2C pins (defined in board.h) */

      lpc54_gpio_config(GPIO_I2C8_SCL);
      lpc54_gpio_config(GPIO_I2C8_SDA);

      /* Set up the FLEXCOMM8 function clock */

      putreg32(BOARD_FLEXCOMM8_CLKSEL, LPC54_SYSCON_FCLKSEL8);
    }
  else
#endif
#ifdef CONFIG_LPC54_I2C9_MASTER
  if (port == 9)
    {
      /* Attach 12 MHz clock to FLEXCOMM9 */

      lpc54_flexcomm9_enableclk();

      /* Set FLEXCOMM9 to the I2C peripheral, locking that configuration
       * in place.
       */

      putreg32(FLEXCOMM_PSELID_PERSEL_I2C | FLEXCOMM_PSELID_LOCK,
               LPC54_FLEXCOMM9_PSELID);

      /* Initialize the state structure */

      priv           = &g_i2c9_dev;
      priv->base     = LPC54_FLEXCOMM9_BASE;
      priv->fclock   = BOARD_FLEXCOMM9_FCLK;
#ifndef CONFIG_I2C_POLLED
      priv->irq      = LPC54_IRQ_FLEXCOMM9;
#endif

      /* Configure I2C pins (defined in board.h) */

      lpc54_gpio_config(GPIO_I2C9_SCL);
      lpc54_gpio_config(GPIO_I2C9_SDA);

      /* Set up the FLEXCOMM9 function clock */

      putreg32(BOARD_FLEXCOMM9_CLKSEL, LPC54_SYSCON_FCLKSEL9);
    }
  else
#endif
    {
      i2cerr("ERROR: Unsupported port=%d\n", port);
      leave_critical_section(flags);
      return NULL;
    }

  leave_critical_section(flags);

  /* Install our operations */

  priv->dev.ops = &lpc54_i2c_ops;

  /* Enable the I2C peripheral in the master  mode */

  regval  = lpc54_i2c_getreg(priv, LPC54_I2C_CFG_OFFSET);
  regval &= I2C_CFG_ALLENABLES;
  regval |= I2C_CFG_MSTEN;
  lpc54_i2c_putreg(priv, LPC54_I2C_CFG_OFFSET, regval);

  /* Set the default I2C frequency */

  lpc54_i2c_setfrequency(priv, I2C_DEFAULT_FREQUENCY);

#ifndef CONFIG_I2C_POLLED
  /* Attach Interrupt Handler */

  irq_attach(priv->irq, lpc54_i2c_interrupt, priv);
#endif

  /* Disable interrupts at the I2C peripheral */

  lpc54_i2c_putreg(priv, LPC54_I2C_INTENCLR_OFFSET, I2C_INT_ALL);

#ifndef CONFIG_I2C_POLLED
  /* Enable interrupts at the NVIC */

  up_enable_irq(priv->irq);
#endif
  return &priv->dev;
}

/****************************************************************************
 * Name: lpc54_i2cbus_uninitialize
 *
 * Description:
 *   Uninitialise an I2C device
 *
 ****************************************************************************/

int lpc54_i2cbus_uninitialize(struct i2c_master_s *dev)
{
  struct lpc54_i2cdev_s *priv = (struct lpc54_i2cdev_s *)dev;
  uint32_t regval;

  /* Disable I2C interrupts */

  lpc54_i2c_putreg(priv, LPC54_I2C_INTENCLR_OFFSET, I2C_MASTER_INTS);

  /* Disable the I2C peripheral */

  regval  = lpc54_i2c_getreg(priv, LPC54_I2C_CFG_OFFSET);
  regval &= I2C_CFG_ALLENABLES;
  regval &= ~I2C_CFG_MSTEN;
  lpc54_i2c_putreg(priv, LPC54_I2C_CFG_OFFSET, regval);

#ifndef CONFIG_I2C_POLLED
  /* Disable the Flexcomm interface at the NVIC and detach the interrupt. */

  up_disable_irq(priv->irq);
  irq_detach(priv->irq);
#endif

  return OK;
}

#endif /* HAVE_I2C_MASTER_DEVICE */
